{
    "title": "Grace Hopper",
    "simple": "hopper",
    "id": 5,
    "image": "/images/hopper.jpg",
    "image_alt": null,
    "image_credit": "Surbhi Bharadwaj / YDN",
    "status": null,
    "bearing": 172,
    "center": [-72.9271882686457, 41.31003332154904],
    "marker": [-72.927177, 41.309967],
    "pitch": 40,
    "speed": 0.13,
    "zoom": 18.37184040845532,
    "text": "Above the entrance to the college office is an etching of Grace Hopper College's former namesake, John C. Calhoun. Calhoun was a Yale alum from South Carolina, one of the 19th century's foremost white supremacists and a politican who advocated for slavery as a \"positive good.\" In 2017, Yale changed the name to Grace Hopper College after years of activism from students, workers, and New Haven residents. The movement to rename Calhoun revitalized in 2015, in the wake of protests in Ferguson, Missouri and concurrent movements at Yale. Black students at Yale led the campaign to rename Calhoun, with key support from various community groups including New Haven immigrants rights' activists from Unidad Latina en Acción (ULA). nA critical moment in the movement occurred in July 2016, when a dining hall worker named Corey Menafee used a broomstick to smash a stained glass window inside the Calhoun dining hall that depicted two slaves carrying bales of cotton. In [an interview](https://www.democracynow.org/2016/7/15/exclusive_meet_yale_dishwasher_corey_menafee), Menafee explained why he smashed the window, saying, \"something inside me said, you know, that thing has to come down...as soon as you look at it, it just hurts. You feel it in your heart, like, oh, man… we shouldn't have to be subjected to those primitive and degrading images.\" \nYale pressured Menafee to resign and pressed charges against him for destruction of property. In the weeks following, the story made national news. Many students and faculty at Yale spoke out in Menafee's support. With backing from Yale's powerful blue-collar union, Local 35, Menafee was eventually hired back and the university dropped charges against him. Corey Menafee now works in the Morse-Stiles dining hall."
  }