{
    "title": "Cross Campus",
    "simple": "xc",
    "id": 7,
    "image": "/images/xc.jpg",
    "image_alt": null,
    "image_credit": "Alex Zhang / YDN",
    "status": null,
    "bearing": -61.60000000000003,
    "center": [-72.9274829694881, 41.310588554014174],
    "marker": [-72.927647, 41.310691],
    "pitch": 20,
    "speed": 0.1,
    "zoom": 17.8,
    "text": "On November 10, 2015, students of color and their allies under the umbrella name \"Next Yale\" held the March of Resilience, which gathered over 1,000 students on Cross Campus to demand the Yale administration take action to address a number of recent racist incidents on campus (see: SAE Fraternity, Grace Hopper College). In addition to ongoing discussion regarding the potential renaming of Calhoun College, students demanded recourse regarding [an email](https://medium.com/@denrsch/what-s-going-on-at-yale-a-reading-list-b9031ec8bd43) sent out of Assistant Head of College Erica Christakis which told students to \"look away\" if they saw offensive Halloween costumes. Next Yale presented six demands, including that Calhoun College be renamed, the two new colleges be named after women of color, and the promotion of the program in Ethnicity, Race, & Migration to departmental status. The students in Next Yale also explicitly linked [their demands](https://downatyale.com/nextyale-demands-for-the-administration/) to demands made by Black students at Yale in the 1960s, evincing the clear connections between different decades of Yale students of color.\nA few of their demands were met; one of the new colleges was named after Pauli Murray, a Black genderqueer activist and promiment civil rights lawyer. However, most were not. Ethnicity, Race, & Migration continued to struggle with hiring and retaining faculty, and in March 2019, all 13 tenured faculty members publicly withdrew their labor from the program in protest of unsustainable conditions. A student group called the Coalition for Ethnic Studies [emerged in response](https://yaledailynews.com/blog/2019/04/02/students-organize-to-support-erm-professors-withdrawal/) and held an Ethnic Studies Pop-Up Library on Cross Campus."
  }